TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПланыРазгрузкиСудов/гкс_ПланыРазгрузкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПланыРазгрузкиСудов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияОбработкиСудов/гкс_СостоянияОбработкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияОбработкиСудов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияОбработкиСудна</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <attributes>
    <name>Коносамент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ДанныеВходногоКонтроляПоЛотам/гкс_ДанныеВходногоКонтроляПоЛотам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ДанныеВходногоКонтроляПоЛотам</name>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </resources>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лот</name>
    <type>
      <types>CatalogRef.гкс_Лоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиГруппировкиПоЛотам/гкс_НастройкиГруппировкиПоЛотам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиГруппировкиПоЛотам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемЛота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемГрузаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемГрузаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/гкс_ПрибытиеСуднаНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ПрибытиеСуднаНаПЛК</name>
  <basedOn>Document.гкс_Фрахт</basedOn>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ТранспортныеДокументыФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеДокументы</name>
    <attributes>
      <name>ТранспортныйДокумент</name>
      <type>
        <types>DocumentRef.гкс_ТранспортныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВТрюме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/гкс_РабочаяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РабочаяСмена</name>
  <registerRecords>InformationRegister.гкс_СостоянияОбработкиСудов</registerRecords>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ВыработкаСмены</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработкаСудна</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весы</name>
      <type>
        <types>CatalogRef.гкс_ОборудованиеПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгруженПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_Лоты/гкс_Лоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_Лоты</name>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_МорскаяЛогистика/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	ТипЗнчДокумента = ТипЗнч(Документ);
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ТипЗнчДокумента = Тип("ДокументОбъект.гкс_УстановкаНастроекГруппировкиПоЛотам") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_НастройкиГруппировкиПоЛотам);
		ИначеЕсли ТипЗнчДокумента = Тип("ДокументОбъект.гкс_Фрахт") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_ПланыРазгрузкиСудов);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_СостоянияФрахта);
		ИначеЕсли ТипЗнчДокумента = Тип("ДокументОбъект.гкс_РабочаяСмена") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_СостоянияОбработкиСудов);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыНакопления.гкс_ОбработкаСудов);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыНакопления.гкс_ВыработкаСмены);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_СостоянияФрахта);
		ИначеЕсли ТипЗнчДокумента = Тип("ДокументОбъект.гкс_ПрибытиеСуднаНаПЛК") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыНакопления.гкс_ОбработкаСудов);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_СостоянияФрахта);
			Параметры.ПодчиненныеРегистры.Добавить(
				Метаданные.РегистрыСведений.гкс_ТранспортныеДокументыФрахта);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.ЕстьПроизводныеДвижения = Истина;
	
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_НастройкиГруппировкиПоЛотам");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_ПланыРазгрузкиСудов");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_СостоянияОбработкиСудов");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_ОбработкаСудов");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_ВыработкаСмены");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_СостоянияФрахта");
	гкс_ПроведениеДокументов.ОтразитьДвижения(
		ТаблицыДляДвижений, Движения, "гкс_ТранспортныеДокументыФрахта");
	
КонецПроцедуры

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирования движений по независимым регистрам основных средств.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Документ - ДокументСсылка - ссылка на документ
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеОбъектов

// Формирует данные для заполнения Регистрации на ПЛК на основании Прибытия судна на ПЛК.
// 
// Параметры:
//  ПрибытиеНаПЛК - ДокументСсылка.гкс_ПрибытиеСуднаНаПЛК - Прибытие на ПЛК
//  ТранспортныйДокумент - ДокументСсылка.гкс_ТранспортныйДокумент - Транспортный документ
// 
// Возвращаемое значение:
//  Неопределено, Структура - Данные заполнения регистрации на ПЛК:
// * ДокументОснование - ДокументСсылка.гкс_ПрибытиеСуднаНаПЛК -
// * ТранспортныйДокумент - ДокументСсылка.гкс_ТранспортныйДокумент -
// * ВесБрутто - Число -
// * ВесНетто - Число -
// * Номенклатура - СправочникСсылка.Номенклатура -
// * ЕдиницаИзмеренияВеса - СправочникСсылка.УпаковкиЕдиницыИзмерения -
// * ТранспортноеСредство - СправочникСсылка.ТранспортныеСредства -
// * Дата - Дата - 
// * ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - 
// * ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - 
// * ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - 
// * УсловиеПроезда - СправочникСсылка.гкс_УсловияПроезда - 
Функция ДанныеЗаполненияРегистрацииНаПЛК(ПрибытиеНаПЛК, ТранспортныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрибытиеНаПЛК", ПрибытиеНаПЛК);
	Запрос.УстановитьПараметр("ТранспортныйДокумент", ТранспортныйДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрибытиеСуднаНаПЛК.Ссылка КАК ДокументОснование,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.КоличествоВТрюме КАК ВесБрутто,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.КоличествоВТрюме КАК ВесНетто,
	|	ПрибытиеСуднаНаПЛК.Номенклатура КАК Номенклатура,
	|	ПрибытиеСуднаНаПЛК.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ДокументФрахт.Судно КАК ТранспортноеСредство
	|ИЗ
	|	Документ.гкс_ПрибытиеСуднаНаПЛК КАК ПрибытиеСуднаНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК.ТранспортныеДокументы КАК
	|			ПрибытиеСуднаНаПЛКТранспортныеДокументы
	|		ПО ПрибытиеСуднаНаПЛК.Ссылка = ПрибытиеСуднаНаПЛКТранспортныеДокументы.Ссылка
	|		И ПрибытиеСуднаНаПЛК.Ссылка = &ПрибытиеНаПЛК
	|		И ПрибытиеСуднаНаПЛКТранспортныеДокументы.ТранспортныйДокумент = &ТранспортныйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Фрахт КАК ДокументФрахт
	|		ПО ПрибытиеСуднаНаПЛК.Фрахт = ДокументФрахт.Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗаполнения = ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("ТочкаМаршрута", Константы.гкс_ТочкаМаршрутаБазы.Получить());
	ДанныеЗаполнения.Вставить("ТипРегистрации", Перечисления.гкс_ТипРегистрации.Приемка);
	ДанныеЗаполнения.Вставить("ВидПеревозки", Перечисления.гкс_ТипыТранспортныхСредствДоставки.Судно);
	ДанныеЗаполнения.Вставить("УсловиеПроезда", Справочники.гкс_УсловияПроезда.DAP);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Проверяет возможность создания документа Прибытие судна на ПЛК на основании переданного Фрахта.
// 
// Параметры:
//  Фрахт - ДокументСсылка.гкс_Фрахт - проверяемый документ.
// 
// Возвращаемое значение:
//  Булево - Доступно создание документа Прибытие судна на ПЛК.
Функция ДоступноСозданиеПрибытияСуднаНаПЛК(Фрахт) Экспорт
	
	КоллекцияНеобработанныхФрахтов = гкс_МорскаяЛогистикаВызовСервера.КоллекцияНеобработанныхФрахтов();
	Возврат Не КоллекцияНеобработанныхФрахтов.Найти(Фрахт) = Неопределено;
	
КонецФункции

#КонецОбласти

// Возвращает Фрахт по Документу регистрации.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации для поиска записей.
// 
// Возвращаемое значение:
//  Неопределено, ДокументСсылка.гкс_Фрахт - Фрахт найденный по документу регистрации.
Функция ФрахтПоДокументуРегистрации(ДокументРегистрации) Экспорт
	
	Фрахт = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументПрибытиеСуднаНаПЛК.Фрахт КАК Фрахт
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК ДокументРегистрацияНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|		ПО ДокументРегистрацияНаПЛК.ДокументОснование = ДокументПрибытиеСуднаНаПЛК.Ссылка
	|		И ДокументРегистрацияНаПЛК.Ссылка = &ДокументРегистрации
	|		И НЕ ДокументРегистрацияНаПЛК.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Фрахт = Выборка.Фрахт;
	КонецЕсли;
	
	Возврат Фрахт;
	
КонецФункции

// Возвращает упорядоченный массив Трюмов переданного Фрахта.
// 
// Параметры:
//  Фрахт - ДокументСсылка.гкс_Фрахт - Фрахт для получения коллекции трюмов
// 
// Возвращаемое значение:
//  Массив из Строка - Трюмы фрахта
Функция ТрюмыФрахта(Фрахт) Экспорт
	
	КоллекцияТрюмов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|ГДЕ
	|	ПланыРазгрузкиСудов.Фрахт = &Фрахт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияТрюмов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Трюм", Истина);
	КонецЕсли;
	
	Возврат КоллекцияТрюмов;
	
КонецФункции

// Возвращает массив Рабочих смен для переданного Фрахта.
// 
// Параметры:
//  Фрахт - ДокументСсылка.гкс_Фрахт - Фрахт для получения коллекции трюмов
//  ТолькоОткрытые - Булево - если Истина, то метод вернет только открытые смены,
//  							иначе все найденные.
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_РабочаяСмена - Рабочие смены Фрахта.
Функция СменыФрахта(Фрахт, ТолькоОткрытые = Ложь) Экспорт
	
	КоллекцияДокументов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаСменыФрахта());
	ПоследнийЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорПоследнегоЗапроса = ПоследнийЗапросПакета.Операторы[0];
	// Установить условие в схему запроса.
	Если ТолькоОткрытые Тогда 
		ОператорПоследнегоЗапроса.Отбор.Добавить("ДокументРабочаяСмена.ДатаОкончания = &ПустаяДата");
		Запрос.УстановитьПараметр("ПустаяДата", гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		КоллекцияДокументов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Ссылка", Истина);
	КонецЕсли;
	
	Возврат КоллекцияДокументов;
	
КонецФункции

// Возвращает Состояния обработки трюмов фрахта в виде таблицы значений.
// 
// Параметры:
//  Фрахт - ДокументСсылка.гкс_Фрахт - Фрахт для отбора записей.
//  Период - Дата, Неопределено - Период для получения записей. 
//  							  Если Неопределено, то записи выбираются на текущую дату.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Состояния обработки трюмов фрахта
Функция СостоянияОбработкиТрюмовФрахта(Фрахт, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияОбработкиСудов.Период КАК Период,
	|	СостоянияОбработкиСудов.Фрахт КАК Фрахт,
	|	СостоянияОбработкиСудов.Трюм КАК Трюм,
	|	СостоянияОбработкиСудов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_СостоянияОбработкиСудов.СрезПоследних(&Период, Фрахт = &Фрахт) КАК СостоянияОбработкиСудов";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Только для внутреннего использования. Метод получает настройки группировки по лотам и разбивает объем груза на судне
// на Лоты (порции выгрузки). Недостающие Лоты будт созданы, лишние - удалены.
// 
// Параметры:
//  НаДату - Дата - период для получения настроек (ожидается дата прибытия судна на ПЛК).
//  Фрахт - ДокументСсылка.гкс_Фрахт - владелец создаваемых лотов.
//  Отказ - Булево - Отказ
Процедура АктуализироватьЛотыДляФрахта(НаДату, Фрахт, Отказ) Экспорт

	ТаблицыЗапроса = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.Текст = ТекстЗапросаЛотыДляФрахта(ТаблицыЗапроса);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЛотыФрахта = РезультатЗапроса[ТаблицыЗапроса.ЛотыФрахта].Выгрузить();
	НастройкиГруппировки = гкс_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(
		РезультатЗапроса[ТаблицыЗапроса.НастройкиГруппировки].Выгрузить()[0]);
	Если НастройкиГруппировки.ОбъемЛота = 0 Тогда
		
		// Настройки не получены.
		ОбъектМетаданных = Фрахт.Метаданные(); // Замечания SQ
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не заданы настройки группировки по лотам для %1'"), НастройкиГруппировки.ТочкаМаршрута);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.Настройки группировки по лотам'"),
			УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, Фрахт, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	ИначеЕсли НастройкиГруппировки.ОбъемГруза = 0 Тогда 
		
		// Настройки получены, но груза на судне нет:
		// Удалить Лоты Фрахта, если они были созданы ранее.
		УдалитьЛотыФрахта(ЛотыФрахта, НастройкиГруппировки, Отказ);
		
	Иначе
		
		// Настройки получены, груз на судне есть:
		// Пересоздать нужно количество Лотов Фрахта.
		СоздатьОбновитьЛотыФрахта(ЛотыФрахта, НастройкиГруппировки, Отказ);
		
		// Удалить Лоты, ставшие не нужными после обновления. 
		УдалитьЛотыФрахта(ЛотыФрахта, НастройкиГруппировки, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьОбновитьЛотыФрахта(ЛотыФрахта, НастройкиГруппировки, Отказ)
	
	Попытка
		
		ПервичныеДанныеВходногоКонтроля = РегистрыСведений.гкс_ДанныеВходногоКонтроляПоЛотам.ТаблицаНабораЗаписей();
		НомерЛота = 1;
		Пока НастройкиГруппировки.ОбъемГруза > 0 Цикл
			
			УказательНаЛот = ЛотыФрахта.Найти(НомерЛота, "НомерЛота");
			Если УказательНаЛот = Неопределено Тогда
				
				ТекущийЛот = Справочники.гкс_Лоты.СоздатьЭлемент();
				ТекущийЛот.НомерЛота = НомерЛота;
				ТекущийЛот.Фрахт = НастройкиГруппировки.Фрахт;
				ТекущийЛот.Номенклатура = НастройкиГруппировки.Номенклатура;
				
			Иначе
				ТекущийЛот = УказательНаЛот.Лот.ПолучитьОбъект();
				УказательНаЛот.Отработан = Истина;
			КонецЕсли;
			
			Если НеобходимоУвеличитьОбъемЛота(НастройкиГруппировки) Тогда 
				ТекущийЛот.Объем = НастройкиГруппировки.ОбъемГруза;
			Иначе 
				ТекущийЛот.Объем = НастройкиГруппировки.ОбъемЛота;
			КонецЕсли;
			
			ТекущийЛот.Записать();
			
			Если ТекущийЛот.ЭтоНовыйОбъект() Тогда
				ДобавитьСтрокуВПервичныеДанныеВходногоКонтроля(ПервичныеДанныеВходногоКонтроля, ТекущийЛот);
			КонецЕсли;
			
			НастройкиГруппировки.ОбъемГруза = НастройкиГруппировки.ОбъемГруза - ТекущийЛот.Объем;
			НомерЛота = НомерЛота + 1;
			
		КонецЦикла;
		
		РегистрыСведений.гкс_ДанныеВходногоКонтроляПоЛотам.ДобавитьНовыеЗаписи(ПервичныеДанныеВходногоКонтроля);
		
	Исключение
		
		ОбработатьИсключениеОперацииПоЛотамФрахта(
			НСтр("ru = 'Морская логистика.Создание лотов'"), НастройкиГруппировки, Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьЛотыФрахта(ЛотыФрахта, НастройкиГруппировки, Отказ)
	
	Попытка
		
		ПервичныеДанныеВходногоКонтроля = РегистрыСведений.гкс_ДанныеВходногоКонтроляПоЛотам.ТаблицаНабораЗаписей();
		Для Каждого УказательНаЛот Из ЛотыФрахта Цикл
				
			Если УказательНаЛот.Отработан Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущийЛот = УказательНаЛот.Лот.ПолучитьОбъект();
			ТекущийЛот.ОбменДанными.Загрузка = Истина;
			ТекущийЛот.УстановитьПометкуУдаления(Истина);
			
			УказательНаЛот.Отработан = Истина;
			
			ДобавитьСтрокуВПервичныеДанныеВходногоКонтроля(ПервичныеДанныеВходногоКонтроля, ТекущийЛот);
			
		КонецЦикла;
		
		РегистрыСведений.гкс_ДанныеВходногоКонтроляПоЛотам.УдалитьЗаписи(ПервичныеДанныеВходногоКонтроля);
		
	Исключение
		
		ОбработатьИсключениеОперацииПоЛотамФрахта(
			НСтр("ru = 'Морская логистика.Удаление лотов'"), НастройкиГруппировки, Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВПервичныеДанныеВходногоКонтроля(ПервичныеДанныеВходногоКонтроля, ТекущийЛот)
	
	СтрокаПервичныхДанных = ПервичныеДанныеВходногоКонтроля.Добавить();
	СтрокаПервичныхДанных.Фрахт = ТекущийЛот.Фрахт;
	СтрокаПервичныхДанных.Лот 	= ТекущийЛот.Ссылка;
	
КонецПроцедуры

Функция НеобходимоУвеличитьОбъемЛота(НастройкиГруппировки)
	Возврат (НастройкиГруппировки.ОбъемГруза - НастройкиГруппировки.ОбъемЛота) < НастройкиГруппировки.ОбъемЛота;
КонецФункции

Процедура ОбработатьИсключениеОперацииПоЛотамФрахта(ИмяСобытия, НастройкиГруппировки, Отказ)
	
	ОбъектМетаданных = НастройкиГруппировки.Фрахт.Метаданные();
	ИнформацияОбОшибке = ИнформацияОбОшибке();
	ПредставлениеОшибкиДляПользователя = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПредставлениеОшибкиДляЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, 
		НастройкиГруппировки.Фрахт, ПредставлениеОшибкиДляЖурнала);
	ОбщегоНазначения.СообщитьПользователю(ПредставлениеОшибкиДляПользователя,,,, Отказ);
	
КонецПроцедуры

Функция ТекстЗапросаЛотыДляФрахта(ТаблицыЗапроса)
	
	ТаблицыЗапроса.Вставить("ВТ_ДанныеФрахта", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ВТ_НастройкиГруппировки", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("НастройкиГруппировки", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ЛотыФрахта", ТаблицыЗапроса.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ДокументФрахт.Ссылка КАК Фрахт,
	|	ДокументФрахт.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЕСТЬNULL(ФрахтГрузы.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ФрахтГрузы.Количество, 0)) КАК ОбъемГруза
	|ПОМЕСТИТЬ ДанныеФрахта
	|ИЗ
	|	Документ.гкс_Фрахт КАК ДокументФрахт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Фрахт.Грузы КАК ФрахтГрузы
	|		ПО ДокументФрахт.Ссылка = ФрахтГрузы.Ссылка
	|ГДЕ
	|	ДокументФрахт.Ссылка = &Фрахт
	|СГРУППИРОВАТЬ ПО
	|	ДокументФрахт.ТочкаМаршрута,
	|	ДокументФрахт.Ссылка,
	|	ЕСТЬNULL(ФрахтГрузы.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиГруппировкиПоЛотам.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НастройкиГруппировкиПоЛотам.ОбъемЛота КАК ОбъемЛота,
	|	НастройкиГруппировкиПоЛотам.ОбъемГрузаОт КАК ОбъемГрузаОт,
	|	НастройкиГруппировкиПоЛотам.ОбъемГрузаДо КАК ОбъемГрузаДо
	|ПОМЕСТИТЬ НастройкиГруппировкиПоЛотам
	|ИЗ
	|	РегистрСведений.гкс_НастройкиГруппировкиПоЛотам.СрезПоследних(&НаДату, ТочкаМаршрута В
	|		(ВЫБРАТЬ
	|			ДанныеФрахта.ТочкаМаршрута
	|		ИЗ
	|			ДанныеФрахта)) КАК НастройкиГруппировкиПоЛотам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФрахта.Фрахт КАК Фрахт,
	|	ДанныеФрахта.ОбъемГруза КАК ОбъемГруза,
	|	ДанныеФрахта.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеФрахта.ТочкаМаршрута) КАК ТочкаМаршрута,
	|	ЕСТЬNULL(НастройкиГруппировкиПоЛотам.ОбъемЛота, 0) КАК ОбъемЛота
	|ИЗ
	|	ДанныеФрахта КАК ДанныеФрахта
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГруппировкиПоЛотам КАК НастройкиГруппировкиПоЛотам
	|		ПО ДанныеФрахта.ТочкаМаршрута = НастройкиГруппировкиПоЛотам.ТочкаМаршрута
	|		И ДанныеФрахта.ОбъемГруза >= НастройкиГруппировкиПоЛотам.ОбъемГрузаОт
	|		И ДанныеФрахта.ОбъемГруза <= НастройкиГруппировкиПоЛотам.ОбъемГрузаДо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛотыФрахта.Ссылка КАК Лот,
	|	ЛотыФрахта.Объем КАК Объем,
	|	ЛотыФрахта.Фрахт КАК Фрахт,
	|	ЛотыФрахта.НомерЛота КАК НомерЛота,
	|	ЛОЖЬ КАК Отработан
	|ИЗ
	|	Справочник.гкс_Лоты КАК ЛотыФрахта
	|ГДЕ
	|	ЛотыФрахта.Фрахт = &Фрахт
	|	И НЕ ЛотыФрахта.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЛота";
	
КонецФункции

Функция ТекстЗапросаСменыФрахта()
	
	Возврат 
	"ВЫБРАТЬ
	|	ДокументРабочаяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_РабочаяСмена КАК ДокументРабочаяСмена
	|ГДЕ
	|	ДокументРабочаяСмена.Фрахт = &Фрахт
	|	И НЕ ДокументРабочаяСмена.ПометкаУдаления";
	
КонецФункции

#КонецОбласти
